
  #### plan-nodes-20251022T025559.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.talos-node["nuc-g2p-1"].proxmox_virtual_environment_download_file.talos_iso will be destroyed
  # (because proxmox_virtual_environment_download_file.talos_iso is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "talos_iso" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "talos-1.11.2-nocloud-amd64.iso" -> null
      - id                  = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
      - node_name           = "nuc-g2p-1" -> null
      - overwrite           = false -> null
      - overwrite_unmanaged = false -> null
      - size                = 303378432 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso" -> null
      - verify              = true -> null
    }

  # module.talos-node["nuc-g2p-2"].proxmox_virtual_environment_download_file.talos_iso will be destroyed
  # (because proxmox_virtual_environment_download_file.talos_iso is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "talos_iso" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "talos-1.11.2-nocloud-amd64.iso" -> null
      - id                  = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
      - node_name           = "nuc-g2p-2" -> null
      - overwrite           = false -> null
      - overwrite_unmanaged = false -> null
      - size                = 303378432 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso" -> null
      - verify              = true -> null
    }

  # module.talos-node["nuc-g3p-1"].proxmox_virtual_environment_download_file.talos_iso will be destroyed
  # (because proxmox_virtual_environment_download_file.talos_iso is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "talos_iso" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "talos-1.11.2-nocloud-amd64.iso" -> null
      - id                  = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
      - node_name           = "nuc-g3p-1" -> null
      - overwrite           = false -> null
      - overwrite_unmanaged = false -> null
      - size                = 303378432 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso" -> null
      - verify              = true -> null
    }

  # module.tiles-prod.data.talos_client_configuration.talosconfig will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "talosconfig" {
      + client_configuration = (known after apply)
      + cluster_name         = "tiles"
      + endpoints            = [
          + "10.0.101.21",
          + "10.0.101.22",
          + "10.0.101.31",
        ]
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # module.tiles-prod.data.talos_machine_configuration.machineconfig_cp will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_cp" {
      + cluster_endpoint      = "https://10.0.101.10:6443"
      + cluster_name          = "tiles"
      + config_patches        = [
          + <<-EOT
                "cluster":
                  "apiServer":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "clusterName": "tiles"
                  "controllerManager":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "network":
                    "cni":
                      "name": "none"
                    "podSubnets":
                    - "10.0.103.0/24"
                    "serviceSubnets":
                    - "10.0.104.0/24"
                  "proxy":
                    "disabled": true
                  "scheduler":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                "machine":
                  "features":
                    "diskQuotaSupport": true
                    "hostDNS":
                      "enabled": true
                      "forwardKubeDNSToHost": false
                      "resolveMemberNames": true
                    "imageCache":
                      "localEnabled": true
                    "rbac": true
                  "files":
                  - "content": |
                      [metrics]
                        address = "0.0.0.0:11234"
                    "op": "create"
                    "path": "/etc/cri/conf.d/20-customization.part"
                  "install":
                    "extraKernelArgs":
                    - "vga=795"
                    "image": "factory.talos.dev/installer/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515:v1.11.2"
                    "wipe": true
                  "sysctls":
                    "user.max_user_namespaces": "8192"
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
    }

  # module.tiles-prod.data.talos_machine_configuration.machineconfig_worker will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_worker" {
      + cluster_endpoint      = "https://10.0.101.10:6443"
      + cluster_name          = "tiles"
      + config_patches        = [
          + <<-EOT
                "cluster":
                  "apiServer":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "clusterName": "tiles"
                  "controllerManager":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "network":
                    "cni":
                      "name": "none"
                    "podSubnets":
                    - "10.0.103.0/24"
                    "serviceSubnets":
                    - "10.0.104.0/24"
                  "proxy":
                    "disabled": true
                  "scheduler":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                "machine":
                  "features":
                    "diskQuotaSupport": true
                    "hostDNS":
                      "enabled": true
                      "forwardKubeDNSToHost": false
                      "resolveMemberNames": true
                    "imageCache":
                      "localEnabled": true
                    "rbac": true
                  "files":
                  - "content": |
                      [metrics]
                        address = "0.0.0.0:11234"
                    "op": "create"
                    "path": "/etc/cri/conf.d/20-customization.part"
                  "install":
                    "extraKernelArgs":
                    - "vga=795"
                    "image": "factory.talos.dev/installer/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515:v1.11.2"
                    "wipe": true
                  "sysctls":
                    "user.max_user_namespaces": "8192"
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "worker"
    }

  # module.tiles-prod.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.11"
    }

  # module.tiles-test.data.talos_client_configuration.talosconfig will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "talosconfig" {
      + client_configuration = (known after apply)
      + cluster_name         = "tiles-test"
      + endpoints            = [
          + "10.0.105.32",
        ]
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # module.tiles-test.data.talos_machine_configuration.machineconfig_cp will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_cp" {
      + cluster_endpoint      = "https://10.0.105.10:6443"
      + cluster_name          = "tiles-test"
      + config_patches        = [
          + <<-EOT
                "cluster":
                  "apiServer":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "clusterName": "tiles-test"
                  "controllerManager":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "network":
                    "cni":
                      "name": "none"
                    "podSubnets":
                    - "10.0.107.0/24"
                    "serviceSubnets":
                    - "10.0.108.0/24"
                  "proxy":
                    "disabled": true
                  "scheduler":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                "machine":
                  "features":
                    "diskQuotaSupport": true
                    "hostDNS":
                      "enabled": true
                      "forwardKubeDNSToHost": false
                      "resolveMemberNames": true
                    "imageCache":
                      "localEnabled": true
                    "rbac": true
                  "files":
                  - "content": |
                      [metrics]
                        address = "0.0.0.0:11234"
                    "op": "create"
                    "path": "/etc/cri/conf.d/20-customization.part"
                  "install":
                    "extraKernelArgs":
                    - "vga=795"
                    "image": "factory.talos.dev/installer/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515:v1.11.2"
                    "wipe": true
                  "sysctls":
                    "user.max_user_namespaces": "8192"
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
    }

  # module.tiles-test.data.talos_machine_configuration.machineconfig_worker will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_worker" {
      + cluster_endpoint      = "https://10.0.105.10:6443"
      + cluster_name          = "tiles-test"
      + config_patches        = [
          + <<-EOT
                "cluster":
                  "apiServer":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "clusterName": "tiles-test"
                  "controllerManager":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                  "network":
                    "cni":
                      "name": "none"
                    "podSubnets":
                    - "10.0.107.0/24"
                    "serviceSubnets":
                    - "10.0.108.0/24"
                  "proxy":
                    "disabled": true
                  "scheduler":
                    "extraArgs":
                      "bind-address": "0.0.0.0"
                "machine":
                  "features":
                    "diskQuotaSupport": true
                    "hostDNS":
                      "enabled": true
                      "forwardKubeDNSToHost": false
                      "resolveMemberNames": true
                    "imageCache":
                      "localEnabled": true
                    "rbac": true
                  "files":
                  - "content": |
                      [metrics]
                        address = "0.0.0.0:11234"
                    "op": "create"
                    "path": "/etc/cri/conf.d/20-customization.part"
                  "install":
                    "extraKernelArgs":
                    - "vga=795"
                    "image": "factory.talos.dev/installer/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515:v1.11.2"
                    "wipe": true
                  "sysctls":
                    "user.max_user_namespaces": "8192"
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "worker"
    }

  # module.tiles-test.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.11"
    }

  # module.tiles-test-node["nuc-g3p-2"].proxmox_virtual_environment_download_file.talos_iso will be destroyed
  # (because proxmox_virtual_environment_download_file.talos_iso is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "talos_iso" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "talos-1.11.2-nocloud-amd64.iso" -> null
      - id                  = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
      - node_name           = "nuc-g3p-2" -> null
      - overwrite           = false -> null
      - overwrite_unmanaged = false -> null
      - size                = 303378432 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso" -> null
      - verify              = true -> null
    }

  # module.talos-node["nuc-g2p-1"].module.control.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Control - 7210 - tiles-cp-nuc-g2p-1 - 10.0.7.21" -> null
      - id                      = "7210" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:72:10",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-cp-nuc-g2p-1" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g2p-1" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 7210 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-7210-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 3000 -> null
          - floating       = 3000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:72:10" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.talos-node["nuc-g2p-1"].module.control.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.7.21" -> null
      - hostname               = "tiles-cp-nuc-g2p-1" -> null
      - id                     = "68eef6736c74be634d0ebbeb" -> null
      - local_dns_record       = "tiles-cp-nuc-g2p-1.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:72:10" -> null
      - name                   = "tiles-cp-nuc-g2p-1" -> null
      - note                   = "Control - 7210 - tiles-cp-nuc-g2p-1" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (3 unchanged attributes hidden)
    }

  # module.talos-node["nuc-g2p-1"].module.worker.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Worker - 8210 - tiles-wk-nuc-g2p-1 - 10.0.8.21" -> null
      - id                      = "8210" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:82:10",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-wk-nuc-g2p-1" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g2p-1" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 8210 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 3 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-8210-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 7000 -> null
          - floating       = 7000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:82:10" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.talos-node["nuc-g2p-1"].module.worker.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.8.21" -> null
      - id                     = "68eef6736c74be634d0ebbdf" -> null
      - local_dns_record       = "tiles-wk-nuc-g2p-1.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:82:10" -> null
      - name                   = "tiles-wk-nuc-g2p-1" -> null
      - note                   = "Worker - 8210 - tiles-wk-nuc-g2p-1" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.talos-node["nuc-g2p-2"].module.control.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Control - 7220 - tiles-cp-nuc-g2p-2 - 10.0.7.22" -> null
      - id                      = "7220" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:72:20",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-cp-nuc-g2p-2" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g2p-2" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 7220 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-7220-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 3000 -> null
          - floating       = 3000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:72:20" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.talos-node["nuc-g2p-2"].module.control.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.7.22" -> null
      - hostname               = "tiles-cp-nuc-g2p-2.local.symmatree.com" -> null
      - id                     = "68eef6736c74be634d0ebbd9" -> null
      - local_dns_record       = "tiles-cp-nuc-g2p-2.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:72:20" -> null
      - name                   = "tiles-cp-nuc-g2p-2" -> null
      - note                   = "Control - 7220 - tiles-cp-nuc-g2p-2" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (3 unchanged attributes hidden)
    }

  # module.talos-node["nuc-g2p-2"].module.worker.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Worker - 8220 - tiles-wk-nuc-g2p-2 - 10.0.8.22" -> null
      - id                      = "8220" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:82:20",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-wk-nuc-g2p-2" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g2p-2" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 8220 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 3 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-8220-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 7000 -> null
          - floating       = 7000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:82:20" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.talos-node["nuc-g2p-2"].module.worker.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.8.22" -> null
      - id                     = "68eef6736c74be634d0ebbdc" -> null
      - local_dns_record       = "tiles-wk-nuc-g2p-2.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:82:20" -> null
      - name                   = "tiles-wk-nuc-g2p-2" -> null
      - note                   = "Worker - 8220 - tiles-wk-nuc-g2p-2" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.talos-node["nuc-g3p-1"].module.control.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Control - 7310 - tiles-cp-nuc-g3p-1 - 10.0.7.31" -> null
      - id                      = "7310" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:73:10",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-cp-nuc-g3p-1" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g3p-1" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 7310 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-7310-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 3000 -> null
          - floating       = 3000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:73:10" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.talos-node["nuc-g3p-1"].module.control.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.7.31" -> null
      - id                     = "68eef6726c74be634d0ebbd6" -> null
      - local_dns_record       = "tiles-cp-nuc-g3p-1.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:73:10" -> null
      - name                   = "tiles-cp-nuc-g3p-1" -> null
      - note                   = "Control - 7310 - tiles-cp-nuc-g3p-1" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.talos-node["nuc-g3p-1"].module.worker.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Worker - 8310 - tiles-wk-nuc-g3p-1 - 10.0.8.31" -> null
      - id                      = "8310" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:83:10",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-wk-nuc-g3p-1" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g3p-1" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 8310 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 3 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-8310-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 11000 -> null
          - floating       = 11000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:83:10" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.talos-node["nuc-g3p-1"].module.worker.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.8.31" -> null
      - id                     = "68eef6736c74be634d0ebbe2" -> null
      - local_dns_record       = "tiles-wk-nuc-g3p-1.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:83:10" -> null
      - name                   = "tiles-wk-nuc-g3p-1" -> null
      - note                   = "Worker - 8310 - tiles-wk-nuc-g3p-1" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.tiles-prod.module.talos-node["nuc-g2p-1"].proxmox_virtual_environment_download_file.talos_iso will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-1.11.2-nocloud-amd64.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso"
      + verify              = true
    }

  # module.tiles-prod.module.talos-node["nuc-g2p-2"].proxmox_virtual_environment_download_file.talos_iso will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-1.11.2-nocloud-amd64.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-2"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso"
      + verify              = true
    }

  # module.tiles-prod.module.talos-node["nuc-g3p-1"].proxmox_virtual_environment_download_file.talos_iso will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-1.11.2-nocloud-amd64.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso"
      + verify              = true
    }

  # module.tiles-test.module.talos-node["nuc-g3p-2"].proxmox_virtual_environment_download_file.talos_iso will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-1.11.2-nocloud-amd64.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-2"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso"
      + verify              = true
    }

  # module.tiles-test-node["nuc-g3p-2"].module.control.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Control - 7320 - tiles-test-cp-nuc-g3p-2 - 10.0.7.32" -> null
      - id                      = "7320" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:73:20",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-test-cp-nuc-g3p-2" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g3p-2" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 7320 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-7320-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 3000 -> null
          - floating       = 3000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:73:20" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.tiles-test-node["nuc-g3p-2"].module.control.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.7.32" -> null
      - hostname               = "tiles-test-cp-nuc-g3p-2" -> null
      - id                     = "68eef6736c74be634d0ebbe5" -> null
      - local_dns_record       = "tiles-test-cp-nuc-g3p-2.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:73:20" -> null
      - name                   = "tiles-test-cp-nuc-g3p-2" -> null
      - note                   = "Control - 7320 - tiles-test-cp-nuc-g3p-2" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (3 unchanged attributes hidden)
    }

  # module.tiles-test-node["nuc-g3p-2"].module.worker.proxmox_virtual_environment_vm.main will be destroyed
  # (because proxmox_virtual_environment_vm.main is not in configuration)
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Worker - 8320 - tiles-test-wk-nuc-g3p-2 - 10.0.8.32" -> null
      - id                      = "8320" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:D0:83:20",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiles-test-wk-nuc-g3p-2" -> null
      - network_interface_names = [] -> null
      - node_name               = "nuc-g3p-2" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-single" -> null
      - started                 = false -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 8320 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 3 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 100 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-8320-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 11000 -> null
          - floating       = 11000 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "BC:24:11:D0:83:20" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # module.tiles-test-node["nuc-g3p-2"].module.worker.unifi_user.vm_client will be destroyed
  # (because unifi_user.vm_client is not in configuration)
  - resource "unifi_user" "vm_client" {
      - allow_existing         = true -> null
      - blocked                = false -> null
      - dev_id_override        = 0 -> null
      - fixed_ip               = "10.0.8.32" -> null
      - hostname               = "tiles-test-wk-nuc-g3p-2.local.symmatree.com" -> null
      - id                     = "68eef6736c74be634d0ebbe8" -> null
      - local_dns_record       = "tiles-test-wk-nuc-g3p-2.local.symmatree.com." -> null
      - mac                    = "bc:24:11:d0:83:20" -> null
      - name                   = "tiles-test-wk-nuc-g3p-2" -> null
      - note                   = "Worker - 8320 - tiles-test-wk-nuc-g3p-2" -> null
      - site                   = "default" -> null
      - skip_forget_on_destroy = true -> null
        # (3 unchanged attributes hidden)
    }

  # module.tiles-prod.module.talos-node["nuc-g2p-1"].module.control.proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Control - 7210 - tiles-cp-nuc-g2p-1 - 10.0.101.21"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiles-cp-nuc-g2p-1"
      + network_interface_names = (known after apply)
      + node_name               = "nuc-g2p-1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = false
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = []
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 7210

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 3000
          + floating       = 3000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "BC:24:11:D0:72:10"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.tiles-prod.module.talos-node["nuc-g2p-1"].module.control.unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.101.21"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-cp-nuc-g2p-1.local.symmatree.com."
      + mac                    = "BC:24:11:D0:72:10"
      + name                   = "tiles-cp-nuc-g2p-1"
      + note                   = "Control - 7210 - tiles-cp-nuc-g2p-1"
      + site                   = (known after apply)
      + skip_forget_on_destroy = true
    }

  # module.tiles-prod.module.talos-node["nuc-g2p-1"].module.worker.proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Worker - 8210 - tiles-wk-nuc-g2p-1 - 10.0.101.41"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiles-wk-nuc-g2p-1"
      + network_interface_names = (known after apply)
      + node_name               = "nuc-g2p-1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = false
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = []
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8210

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 7000
          + floating       = 7000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "BC:24:11:D0:82:10"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.tiles-prod.module.talos-node["nuc-g2p-1"].module.worker.unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.101.41"
      + hostname               = (kn ...
  ```

  </details>
  Output is too long and was truncated. You can read full Plan in <a href="https://github.com/symmatree/tiles/actions/runs/18703900269">Actions</a>.<br /><br />
  